app/Modules/LinkedFiles/Controllers/LinkedFiles.php

SELECT *
FROM `check_up_logs`
SELECT *
FROM `personal_logs`
---
    public function index()
    {
        $checkupModel = new CheckUpLogsModel();
        $personalModel = new PersonalLogsModel();
        $allFiles = [];

        $checkups = $checkupModel->findAll();
        foreach ($checkups as $log) {
            $files = json_decode($log['related_files'] ?? '[]', true);
            foreach ($files as $file) {
                $allFiles[] = [
                    'alias'     => 'Check-Up File',
                    'name'      => $file,
                    'date'      => $log['date'],
                    'path'      => base_url('uploads/checkup/' . $file),
                    'isImage'   => preg_match('/\.(jpg|jpeg|png|gif)$/i', $file)
                ];
            }
        }

        $logs = $personalModel->findAll();