app/Modules/CheckUp/Controllers/CheckUp.php

    public function show($id = null)
    {
        $icdModel = new ICDSModel();
        $icds = $icdModel->findAll();
---
SELECT *
FROM `icds`

    public function add()
    {
        $icdModel = new ICDSModel();
        $icds = $icdModel->findAll();
---
SELECT *
FROM `icds`