app/Modules/CheckUp/Models/CheckUpLogsModel.php

SELECT *
FROM `check_up_logs`
WHERE `id` = '1'
 LIMIT 1
---
    public function getDataById($id)
    {
        return $this->where('id', $id)->first();

SELECT `check_up_logs`.*, `icds`.`code` AS `icd_code`, `icds`.`name_en` AS `icd_name`, `icds`.`name_id` AS `icd_name_id`
FROM `check_up_logs`
LEFT JOIN `icds` ON `icds`.`id` = `check_up_logs`.`icd_id`
WHERE `check_up_logs`.`user_id` = '5'
ORDER BY `check_up_logs`.`date` DESC
 LIMIT 4
---
    public function getLatestData($userId)
    {
        return $this->select('check_up_logs.*, icds.code AS icd_code, icds.name_en AS icd_name')
            ->join('icds', 'icds.id = check_up_logs.icd_id', 'left')
            ->where('check_up_logs.user_id', $userId)
            ->orderBy('check_up_logs.date', 'DESC')
            ->limit(4)
            ->find();