app/Modules/User/Models/UserModel.php

    public function getDataById($id)
    {
        return $this->where('id', $id)->first();
---
SELECT *
FROM `user`
WHERE `id` = '5'
 LIMIT 1